#+TITLE: emacs config

Ensure that /use-package/ is installed, then add the MELPA repository.
Here, I use /http/ rather than /https/, because otherwise there is a problem in installing /zetteldeft/ later (and possibly also for other packages)[fn:: https://emacs.stackexchange.com/a/39295/30033].

#+BEGIN_SRC emacs-lisp
(require 'package)

(add-to-list 'package-archives
  '("MELPA" . "http://melpa.org/packages/"))
(add-to-list 'package-archives
  '("org" . "https://orgmode.org/elpa/") t)
(package-initialize)
(package-refresh-contents)

(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(require 'use-package)
#+END_SRC

*** Show tab characters and highlight trailing spaces

    #+begin_src emacs-lisp
(global-whitespace-mode 1)
(setq whitespace-style '(face trailing tabs tab-mark))
    #+end_src

    #+RESULTS:
    | face | trailing | tabs | tab-mark |

